In [1]:
import pandas as pd
import numpy as np

In [2]:
my_list_1 = [1, np.nan, 3, 4]
my_list_1

[1, nan, 3, 4]

In [3]:
my_list_2 = [6.0, 7.0, np.nan, 9]
my_list_2

[6.0, 7.0, nan, 9]

In [4]:
my_list_3 = ['a', 'b', 'c', '']
my_list_3

['a', 'b', 'c', '']

In [5]:
my_dict_1 = {'A': my_list_1}
my_dict_1

{'A': [1, nan, 3, 4]}

In [6]:
my_dict_2 = {'B': my_list_2}
my_dict_2

{'B': [6.0, 7.0, nan, 9]}

In [7]:
my_dict_3 = {'C': my_list_3}
my_dict_3

{'C': ['a', 'b', 'c', '']}

In [8]:
my_dict_4 = {**my_dict_1, **my_dict_2, **my_dict_3}
my_dict_4

{'A': [1, nan, 3, 4], 'B': [6.0, 7.0, nan, 9], 'C': ['a', 'b', 'c', '']}

In [9]:
df1 = pd.DataFrame(
    data={**{'A': my_list_1}, **{'B': my_list_2}, **{'C': my_list_3}}
)
df1

     A    B  C
0  1.0  6.0  a
1  NaN  7.0  b
2  3.0  NaN  c
3  4.0  9.0

In [10]:
df1.dtypes

A    float64
B    float64
C     object
dtype: object

In [11]:
df2 = pd.DataFrame(data=my_dict_4)
df2

     A    B  C
0  1.0  6.0  a
1  NaN  7.0  b
2  3.0  NaN  c
3  4.0  9.0

In [12]:
df2.dtypes

A    float64
B    float64
C     object
dtype: object

In [13]:
convert_dict = {'A': 'Int64', 'B': 'float', 'C': 'str'}

In [14]:
df2 = df2.astype(dtype=convert_dict)
df2.dtypes

A      Int64
B    float64
C     object
dtype: object

In [15]:
df2

      A    B  C
0     1  6.0  a
1  <NA>  7.0  b
2     3  NaN  c
3     4  9.0

In [16]:
df3 = pd.DataFrame(data=my_dict_4).astype(dtype=convert_dict)
df3.dtypes

A      Int64
B    float64
C     object
dtype: object

In [17]:
df3

      A    B  C
0     1  6.0  a
1  <NA>  7.0  b
2     3  NaN  c
3     4  9.0

In [18]:
df4 = pd.DataFrame(
    data={
        'A': [1, pd.NA, 3, 4],
        'B': [6.0, 7.0, pd.NA, 9],
        'C': ['a', 'b', 'c', '']
    }
)
df4

      A     B  C
0     1     6  a
1  <NA>     7  b
2     3  <NA>  c
3     4     9

In [19]:
df4.dtypes

A    object
B    object
C    object
dtype: object

In [20]:
df4 = pd.DataFrame(
    data={
        'A': [1, np.nan, 3, 4],
        'B': [6.0, 7.0, np.nan, 9],
        'C': ['a', 'b', 'c', '']
    }
).astype(dtype=convert_dict)
df4

      A    B  C
0     1  6.0  a
1  <NA>  7.0  b
2     3  NaN  c
3     4  9.0

In [21]:
df4.dtypes

A      Int64
B    float64
C     object
dtype: object

In [22]:
my_dict_5 = {
    'A': [1, np.nan, 3, 4],
    'B': [6.0, 7.0, np.nan, 9],
    'C': ['a', 'b', 'c', '']
}

In [23]:
df5 = pd.DataFrame(data=my_dict_5).astype(dtype=convert_dict)
df5

      A    B  C
0     1  6.0  a
1  <NA>  7.0  b
2     3  NaN  c
3     4  9.0

In [24]:
df5.dtypes

A      Int64
B    float64
C     object
dtype: object